nn.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-07-18 Sun 09:31 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Neural Network</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Neural Network</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org293d2d4">Introducation</a></li>
<li><a href="#org4036bd1">McCulloch and Pitts (M-P) model for neurons</a></li>
<li><a href="#org158e034">Activation function</a>
<ul>
<li><a href="#orgbe2295e">Sign</a></li>
<li><a href="#orgbcc713e">Sigmoid</a></li>
<li><a href="#orgb288a8c">Tanh</a></li>
<li><a href="#org878c4a9">ReLU</a></li>
<li><a href="#org83764e7">Softmax</a></li>
</ul>
</li>
<li><a href="#org174b64d">Cost function</a>
<ul>
<li><a href="#org3881692">Cross-entropy</a></li>
</ul>
</li>
<li><a href="#org3152955">Multi-layer feedforward neural network</a></li>
<li><a href="#org2521b1d">Convolutional neural network (CNN)</a>
<ul>
<li><a href="#org768ce62">Pooling</a></li>
</ul>
</li>
<li><a href="#org5f15b7e">Recurrent neural network (RNN)</a>
<ul>
<li><a href="#org5f086d6">Long short term memory (LSTM)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org293d2d4" class="outline-2">
<h2 id="org293d2d4">Introducation</h2>
<div class="outline-text-2" id="text-org293d2d4">
<ul class="org-ul">
<li>The network is composed of an input layer, an output layer, and optionally a series of hidden layers.</li>
<li>Input layer does not carry out any operation/function, but the hidden and output layers consist of functional neurons, i.e., have activation functions.</li>
</ul>
</div>
</div>
<div id="outline-container-org4036bd1" class="outline-2">
<h2 id="org4036bd1">McCulloch and Pitts (M-P) model for neurons</h2>
<div class="outline-text-2" id="text-org4036bd1">
\begin{align*}
  y = f(\mathbf{W} \mathbf{x} - \theta)
\end{align*}
<p>
where \(f\) is termed <i>activation function</i>.
</p>
</div>
</div>
<div id="outline-container-org158e034" class="outline-2">
<h2 id="org158e034">Activation function</h2>
<div class="outline-text-2" id="text-org158e034">
<p>
Activation function aims to introduce the non-linear capability, compensate the shortage of linear models.
</p>
</div>
<div id="outline-container-orgbe2295e" class="outline-3">
<h3 id="orgbe2295e">Sign</h3>
<div class="outline-text-3" id="text-orgbe2295e">
\begin{align*}
  \text{sign}(x) = \begin{cases}
    1, & x \ge 0; \\
    0, & x < 0.
  \end{cases}
\end{align*}
</div>
</div>
<div id="outline-container-orgbcc713e" class="outline-3">
<h3 id="orgbcc713e">Sigmoid</h3>
<div class="outline-text-3" id="text-orgbcc713e">
\begin{align*}
  \text{sigmoid}(x) = \frac{1}{1 + e^{-x}}.
\end{align*}
</div>
</div>
<div id="outline-container-orgb288a8c" class="outline-3">
<h3 id="orgb288a8c">Tanh</h3>
<div class="outline-text-3" id="text-orgb288a8c">
\begin{align*}
  \text{tanh}(x) = \frac{e^x - e^{-x}}{e^x + e^{-x}}.
\end{align*}
</div>
</div>
<div id="outline-container-org878c4a9" class="outline-3">
<h3 id="org878c4a9">ReLU</h3>
<div class="outline-text-3" id="text-org878c4a9">
\begin{align*}
  \text{ReLU}(x) = \max(x, 0)
\end{align*}
</div>
</div>
<div id="outline-container-org83764e7" class="outline-3">
<h3 id="org83764e7">Softmax</h3>
<div class="outline-text-3" id="text-org83764e7">
<p>
Softmax function can transform scores/logits into a valid probability distribution.
</p>
\begin{align*}
  \text{softmax}(x_i) = \frac{e^{x_i}}{\sum_j e^{x_j}}
\end{align*}
</div>
</div>
</div>
<div id="outline-container-org174b64d" class="outline-2">
<h2 id="org174b64d">Cost function</h2>
<div class="outline-text-2" id="text-org174b64d">
</div>
<div id="outline-container-org3881692" class="outline-3">
<h3 id="org3881692">Cross-entropy</h3>
<div class="outline-text-3" id="text-org3881692">
\begin{align*}
  \mathcal{H}_{p}(p^{\prime}) = \sum_{i}p_{i}\log\frac{1}{p^{\prime}_i}
\end{align*}
<p>
where
</p>
<ul class="org-ul">
<li>\(p\) is the true probability distribution.</li>
<li>\(p^\prime\) is the predicted probability distribution.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3152955" class="outline-2">
<h2 id="org3152955">Multi-layer feedforward neural network</h2>
<div class="outline-text-2" id="text-org3152955">
<ul class="org-ul">
<li>Full connection between neurons of the adjacent ranks.</li>
<li>No connection between neurons of the identical rank.</li>
</ul>
</div>
</div>
<div id="outline-container-org2521b1d" class="outline-2">
<h2 id="org2521b1d">Convolutional neural network (CNN)</h2>
<div class="outline-text-2" id="text-org2521b1d">
<ul class="org-ul">
<li>The operation of a convolutional layer is to apply a filter on the input.
<ul class="org-ul">
<li>The weights of the filter is termed <i>kernel</i>.</li>
</ul></li>
<li>In fact, a convolutional layer is a simplified full connection layer, with following specialties.
<ul class="org-ul">
<li>\(\mathbf{W}\) is a diagonal matrix.</li>
<li>The non-zero elements in different rows are equal.</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org768ce62" class="outline-3">
<h3 id="org768ce62">Pooling</h3>
<div class="outline-text-3" id="text-org768ce62">
<ul class="org-ul">
<li>A convolutional layer is usually followed by a <i>pooling</i> layer to
<ul class="org-ul">
<li>Reduce the output of a convolutional layer.</li>
<li>Ignore the subtle variations/shifts of the image position.</li>
</ul></li>
<li>Popular pooling layers
<ul class="org-ul">
<li>Maximum</li>
<li>Average</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5f15b7e" class="outline-2">
<h2 id="org5f15b7e">Recurrent neural network (RNN)</h2>
<div class="outline-text-2" id="text-org5f15b7e">
<ul class="org-ul">
<li>A learned/trained function takes both input vector and its state vector as input and yields an output and an updated state vector.</li>
<li>In the front of large scale sequences, an ordinary/standard RNN suffers gradient disappear and gradient explosion. To solve the problems, some variants have been proposed, e.g. <i>long short term memory (LSTM)</i>.</li>
</ul>
</div>
<div id="outline-container-org5f086d6" class="outline-3">
<h3 id="org5f086d6">Long short term memory (LSTM)</h3>
</div>
</div>
</div>
</body>
</html>
